[
    "\n        The 2020 UEFA European Football Championship, commonly referred to as UEFA Euro 2020 or simply Euro 2020, was the 16th UEFA European Championship, the quadrennial international men's football championship of Europe organised by the Union of European Football Associations (UEFA).[1] To celebrate the 60th anniversary of the European Championship competition, UEFA President Michel Platini declared that the tournament would be hosted in several nations as a \"romantic\" one-off event, with 11 cities in 11 UEFA countries each providing venues for the tournament.[2] Portugal were the defending champions, having won the 2016 competition in France, but were eliminated in the round of 16 by Belgium.[3] Italy won their second European Championship title after beating England on penalties in the final following a 1–1 draw after extra time.[4]\n\n        Due to the COVID-19 pandemic in Europe during 2020, the tournament was postponed to summer 2021,[5] while retaining the name UEFA Euro 2020 and host venues.[6] Alongside special rules regarding COVID-19, UEFA also allowed more substitutions [7] and implemented video assistant referee (VAR) for the first time.[8]\n\n        Although thirteen venues had been chosen for the tournament, two were later dropped owing to issues: Brussels in December 2017 after the building of the city's Eurostadium was abandoned;[9] and Dublin in April 2021, because there was no guarantee that spectators could attend. Spain originally intended to use Bilbao as a host venue but later changed it to Seville to allow for spectators at matches.[10] UEFA chose Stadio Olimpico in Rome to host the opening match between Turkey and Italy, while Wembley Stadium in London was granted the right to host the semi-finals and final for the second time,[11] having done so before at the 1996 tournament in the stadium's former incarnation.\n\n        The tournament was well-received by fans and commentators, with the most goals per game in a European Championship since the introduction of the group stage, and only two goalless games. The refereeing style was also praised. There were upsets when Belgium, Sweden, and world champions France lost to lower-ranked sides.\n    ",
    "The NBA Finals is the annual championship series of the National Basketball Association (NBA). The Eastern and Western conference champions play a best-of-seven game series to determine the league champion. The team that wins the series is awarded the Larry O'Brien Championship Trophy, which replaced the Walter A. Brown Trophy in 1983.\n\nThe series was initially known as the BAA Finals prior to the 1949–50 season when the Basketball Association of America (BAA) merged with the National Basketball League (NBL) to form the NBA. The competition oversaw further name changes to NBA World Championship Series from 1950 to 1985, as well as a brief stint as the Showdown, before settling on NBA Finals in 1986.[1] Since 2018, it has been officially known as the NBA Finals presented by YouTube TV for sponsorship reasons.[2][3]\n\nThe NBA Finals was initially structured in a 2–2–1–1–1 format. In 1985, to ease the amount of cross-country travel, it was changed to a 2–3–2 format, where the first two and last two games of the series were played at the arena of the team who earned home-court advantage by having the better record during the regular season. In 2014, the 2–2–1–1–1 format was restored. This team hosts the first two games and the other team hosts the next two games. If needed, the remaining three are played at each team's home arena alternately.[4]\n\nA total of 19 franchises have won the NBA Finals, with the Los Angeles Lakers winning in 2020. The Lakers and the Boston Celtics hold the record for the most victories, having both won the competition 17 times. The Boston Celtics also won the most consecutive titles, winning eight in a row from 1959 to 1966. The Los Angeles Lakers have contested the NBA Finals the most times, with 32 appearances. The Eastern Conference has provided the most champions, with 38 wins from 10 franchises; the Western Conference has 34, from 9 franchises.",
    "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, a search engine, cloud computing, software, and hardware. It is considered one of the big four technology companies along with Amazon, Facebook, and Apple.[9][10][11]\n\nGoogle was founded in September 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14% of its publicly-listed shares and control 56% of the stockholder voting power through super-voting stock. The company went public via an initial public offering (IPO) in 2004. In 2015, Google was reorganized as a wholly owned subsidiary of Alphabet Inc.. Google is Alphabet's largest subsidiary and is a holding company for Alphabet's Internet properties and interests. Sundar Pichai was appointed CEO of Google on October 24, 2015, replacing Larry Page, who became the CEO of Alphabet. On December 3, 2019, Pichai also became the CEO of Alphabet.[12]\n\nIn 2021, the Alphabet Workers Union was founded, mainly composed of Google employees.[13]\n\nThe company's rapid growth since incorporation has included products, acquisitions, and partnerships beyond Google's core search engine, (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Duo, Google Chat, and Google Meet), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, and Street View), podcast hosting (Google Podcasts), video sharing (YouTube), blog publishing (Blogger), note-taking (Google Keep and Jamboard), and photo organizing and editing (Google Photos). The company leads the development of the Android mobile operating system, the Google Chrome web browser, and Chrome OS (a lightweight, proprietary operating system based on the FOSS Chromium OS operating system). Google has moved increasingly into hardware; from 2010 to 2015, it partnered with major electronics manufacturers in the production of its Google Nexus devices, and it released multiple hardware products in 2016, including the Google Pixel line of smartphones, Google Home smart speaker, Google Wifi mesh wireless router. Google has also experimented with becoming an Internet carrier (Google Fiber and Google Fi).\n\nGoogle.com is the most visited website worldwide. Several other Google-owned websites also are on the list of most popular websites, including YouTube and Blogger.[14] On the list of most valuable brands, Google is ranked second by Forbes[15] and fourth by Interbrand.[16] It has received significant criticism involving issues such as privacy concerns, tax avoidance, censorship, search neutrality, antitrust and abuse of its monopoly position."
  ]